# 08 제어문

코드의 실행 흐름을 인위적으로 제어

조건문과 반복문이 있음

가독성을 해치는 단점.

## 8.1 블록문

자체 종결성 : 블록문 자체가 문의 종료를 의미. 블록문의 끝에는 세미콜론을 붙이지 않음

## 8.2 조건문

조건식의 평가 결과에 따라 블록문의 실행을 결정.

조건식 : 불리언값으로 평가될 수 있는 표현식

### 8.2.1 if … else 문

조건식이 불리언 값이 아닌 값으로 평가되는 경우  암묵적으로 불리언 값으로 강제 변환됨.

코드 블록 내의 문이 하나면 중괄호를 생략할 수 있으며 삼항조건 연산자로도 표현 가능

**삼항조건 연산자와 차이점** 

변수에 할당 가능 : 삼항조건연산자는 값으로 평가되는 표현식이므로 변수에 할당 가능

변수에 할당 불가능 : if … else 문은 표현식이 아닌 문이므로 변수에 할당할 수 없음.

**사용 예**

조건에 따라 단순히 값을 변수에 할당하는 경우 삼항연산자 (가독성이 좋음)

조건에 따라 실행하는 내용이 복잡한 경우 if… else 문

### 8.2.2 switch 문

주어진 표현식을 평가하여 그 값과 일치하는 표현식을 갖는 case문으로 실행 흐름을 옮김.

일치하는 case문이 없으면 default문으로 이동

```jsx
switch(표현식) {
	case 표현식1 :
		표현식 === 표현식1인 경우 실행
		break;
	case 표현식2 :
		표현식 === 표현식2인 경우 실행
		break;
	default
		표현식1, 표현식2 모두 아닐 떄
}
```

switch 문의 표현식은 문자열이나 숫자값인 경우가 많음.

논리적 참 거짓 보다 다양한 상황에따라 실행할 코드블록 결정.

폴스루 : break가 없어 실행 흐름이 swich 문을 탈출하지 않고 case가 계속 실행됨.

폴스루 활용 예 : 여러개의 case문을 하나의 조건으로 사용하는 경우.

### 조건문 활용

if else 문으로 활용할 수 있으면 if else 문으로 활용하고, 조건이 너무 많아서 switch 문을 사용할때 가독성이 좋으면 switch문 활용.

## 8.3 반복문

조건식이 참일때 코드블록을 실행하고 다시 조건식을 평가하여 거짓일 때까지 반복

### 8.3.1 for 문

```jsx
for(변수선언문 할당문; 조건식; 증감식) {
	반복실행될 문
}
```

중첩 for문 사용 가능

### 8.3.2 while 문

조건식의 평가 결과가 참이면 코드 블록을 반복실행.

반복 횟수가 불명확할 때 사용.

무한루프 : 조건식의 평가결과가 언제나 참일경우 무한루프되기 떄문에 if문으로 탈출 조건을 만들고 braek문으로 코드블록을 탈출

```jsx
var count = 0;

while (true) {
	count++;
	if (count === 3) break;
}
```

### 8.3.3 do … while 문

코드블록을 먼저 실행하고 조건식을 평가 : 코드블록이 무조건 한번 이상 실행.

```jsx
var count = 0;

do {
	count++;
} while (count < 3);
```

## 8.4 break 문

레이블 문, 반복문, switch문 탈출. 이 외에 break문을 사용하는경우 syntaxError 발생.

레이블 문은 식별자가 붙은 문으로 switch case와 default문도 레이블문임.

레이블 문은 중첩된 for문 외부로 빠져나가기 유용하지만 그 이외에는 권장하지 않음.

코드흐름이 복잡, 가독성이 나쁨.

## 09 타입 변환과 단축평가

## 9.1 타입 변환

명시적 타입 변환 : 개발자가 의도적으로 값의 타입을 변환

암묵적 타입 변환 : 표현식을 평가하는 도중에 자바스크립트 엔진에 의해 암묵적으로 타입 변환.

기존 변수값을 재할당하는 것이 아니라 피연산자의 값을 암묵적 타입변환해 새로움 타입의 값을 만들어 단 한번 사용하고 버림.

## 9.2 암묵적 타입 변환

### 9.2.1 문자열 타입으로 변환

```jsx
1 + '2' // "12"
```

위 예시에서 + 는 피연산자 중 하나가 문자열이므로 문자열 연결 연산자로 동작함. 이를 위해 문자열이 아닌 피연산자를 문자열로 암묵적 타입 변환함.

### 9.2.2 숫자 타입으로 변환

산술연산자(-, *, /) 사용시 피연산자가 숫자타입이어야함. 따라서 숫자타입으로 암묵적 타입변환 함.

숫자타입으로 변환할 수 없는 경우 산술연산 수행 불가하므로 NaN이 됨.

### 9.2.3 불리언 타입으로 변환

조건식은 논리적 참/거짓이 있어야 하므로 조건식 평가 결과를 암묵적 타입 변환 함.

Truthy(참으로 평가되는 값) Falsy(거짓으로 평가되는 값)

Falsy :

- false
- undefined
- null
- 0, -0
- NaN
- ''(빈 문자열)

## 9.3 명시적 타입 변환

### 9.3.1 문자열 타입으로 변환

1. String 생성자 함수를 new연산자 없이 호출
2. Object.prototype.toString 메서드 사용
3. 문자열 연결 연산자

### 9.3.2 숫자 타입으로 변환

1. Number 생성자 함수를 new 연산자 없이 호출
2. parseInt, parseFloat 함수 사용(문자열에만 사용)
3. ‘+’단항산술연산자 사용
4. ‘*’산술연산자 사용

### 9.3.3 불리언 타입으로 변환

1. Boolean 생성자 함수를 new 없이 호출
2. ! 부정논리 연산자를 두번 사용

## 9.4 단축평가

### 9.4.1 논리연산자를 사용한 단축평가

논리합(||) 논리곱(&&)연산자는 2개의 피연산자 중 어느 한쪽으로 평가됨.

논리연산의 결과를 결정하는 피연산자를 타입 변환하지 않고 그대로 반환함.

논리곱 연산자 : 좌항에서 우항으로 평가 진행. 두번쨰 피연산자가 평과결과를 결정함. 두개가 모두 true일떄 두번째 피연산자를 그대로 반환.

논리합 연산자 : 첫번째 피연산자가 평과결과를 결정함. 첫번째가 true이면 첫번째 피연산자 그대로 반환

단축평가 : 표현식을 평가하는 도중에 평가결과가 확정된 경우 나머지 평가과정을 생략

단축평가의 활용

1. 객체를 가리키기 기대하는 변수가 null 또는 undefined가 아닌지 확인하고 프로퍼티를 참조할 때.
    
    변수 값이 객체가 아니라 null, undefined인 경우 객체의 프로퍼티를 참조하면 타입에러 발생
    

```jsx
var elem = null;
var vaule = elem.value; //type error

var value = elem && elem.value; //null
```

1. 함수 매개변수에 기본값을 설정할 때
    
    함수를 호출할 때 인수를 전달하지 않으면 매개변수에는 undefined가 할당됨. 이떄 기본값을 설정하면 에러 방지할 수 있음.
    

### 9.4.2 옵셔널 체이닝 연산자

좌항의 피연산자가 null 또는 undefined인 경우 undefined를 반환. 그렇지 않으면 우항의 프로퍼티 참조를 이어감.

# 10 객체 리터럴

## 10.1 객체

다양한 타입의 값을 하나의 단위로 구성한 복합적인 자료구조.

원시값은 변경 불가능하지만 객체는 변경 가능하다.

- 프로퍼티 : 객체의 상태를 나타내는 값
- 메서드 : 프로퍼티를 참조하고 조작할 수 있는 동작.

상태와 동작을 하나의 단위로 구조화할 수 있어 유용함.

## 10.2 객체 리터럴에 의한 객체 생성

 

객체 생성 방법

- 객체 리터럴
- Object 생성자 함수
- 생성자 함수
- Object.create 메서드
- 클래스

## 10.3 프로퍼티

- 프로퍼티 키 : 빈 문자열을 포함하는 모든 문자열 또는 값.
- 프로퍼티 값 : 자바스크립트에서 사용할 수 있는 모든 값.

식별자 네이밍 규칠을 따르지 않는 이름에는 반드시 따옴표 사용해야함

프로퍼티 키를 동적으로 생성

```jsx
var obj = {};
var key = 'hello';

obj[key] = 'world';

console.log(obj); // {hello: "world"}
```

# 느낀점

알고 있었던 부분을 다시 정리할 수 있었고, 헷갈리거나 모르는 부분도 학습할 수 있어서 좋았습니다.

가장 인상 깊었던 부분은 단축 평가의 활용이었는데, 기본적인 개념이지만 잘 몰랐다는 생각에 부끄러워지기도 했습니다. 객체의 프로퍼티를 참조할 때 단축 평가를 사용하면 코드가 매우 간결하고 효과적일 것이라는 생각이 들었습니다.

입사 초반에 작성했던 코드에는 이러한 고려사항이 많이 반영되지 않았던 것 같습니다. 기회가 된다면 그 코드를 리팩토링해보고 싶습니다.

11장은 아직 읽기만 하고 정리를 다 하지 못했는데 살짝 어렵게 느껴지는 부분들도 있어서 이번 스터디에서 좀 더 학습 한뒤 추후 업데이트 해놓을 예정입니다.
